#1. შექმენით სია, სადაც გექნებათ 7 სიტყვა, შემდეგ:
shoping = 'bread', 'milk', 'cola', 'cheese','toilet paper','water','sprite'

#* დადებითი ინდექსინგის მეშვეობით გამოიტანეთ მეორე და მესამე სიტყვა.
print (shoping[1:2])

#* დადებითი ინდექსინგის მეშვეობით გამოიტანეთ მეხუთედან ყველა სიტყვა ბოლომდე.
print (shoping[4:])

#* უარყოფითი ინდექსინგის მეშვეობით გამოიტანეთ მეორე და მესამე სიტყვა.
print (shoping[-6:-4])


#* უარყოფითი ინდექსინგის მეშვეობით გამოიტანეთ მეხუთედან ყველა სიტყვა ბოლომდე.
print (shoping[-2:])

#* უაყოფითი და დადებითი ინდექსინგის, ორივეს მეშვეობით, გამოიტანეთ მესამე ელემენტიდან მეექსვეს ჩათვლით ყველა.
print (shoping[2:-1])


