#Easy:
#1. დაპრინტეთ 12 მაგალითი შედარების ოპერატორებზე (<, >, <=, >=, == , !=)
print (12<45)
print (9<23)
print (9>6)
print (12>4)
print (12<=34)
print (34<= 34)
print (14>=13)
print (12>=12)
print (15==15)
print (45==45)
print (67!=60)
print (45!=34)
#2. შეინახე ინტეჯერი ცვლადში, შემდეგ დაპრინტე მისი ტიპი.
name=22
print(type(name))
#3. შეინახე სტრინგი ცვლადში, შემდეგ დაპრინტე მისი ტიპი.
name='goa'
print(type(name))
#. შეინახე ფლოატი ცვლადში, შემდეგ დაპრინტე მისი ტიპი.
name=12.0
print(type(name))
#5. შექმენი ცვლადი, სადაც შეინახავ "42"-ს, შემდეგ ეს ცვლადი გადააქციე ინეტეჯერად და დაპრინტე.
name='42'
print(int(name))
# 6. შექმენი ცვლადი, სადაც შეინახავ "3.14"-ს, შემდეგ ეს ცვლადი გადააქციე ფლოატად და დაპრინტე.
name=3.14
print(float(name))

#Medium:
#7. ცვლადში მომხმარებელს ინფუთით შემოატანინე სტრინგი, და დაპრინტე მისი ტიპი.
name = 'goa'
input(name)
print(type(name))
#8. ცვლადში მომხმარებელს ინფუთით შემოატანინე ინტეჯერი, და დაპრინტე მისი ტიპი.
name = 20
input(name)
print(type(name))
#9. ცვლადში მომხმარებელს ინფუთით შემოატანინე ფლოათი, და დაპრინტე მისი ტიპი.
user= 20.0
input(user)
print(type(user))

